---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GroupLoadOptions Members
GroupLoadOptions Class Constructors Methods Properties See Also Send Feedback
---

The GroupLoadOptions type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
|  | GroupLoadOptions | Creates a new instance of a GroupLoadOptions object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the GroupLoadOptions |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | GetDuplicateTypeNamesHandler | Returns current duplicate type names handler or nullNothingnullptra null reference (Nothing in Visual Basic) if none is set. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | SetDuplicateTypeNamesHandler | Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IncludeAttachedDetails | True if attached detail groups should be included, false otherwise. The default value is trueTruetruetrue (True in Visual Basic). |
|  | IncludeGrids | True if grids should be brought in from the input file, false otherwise. The default value is falseFalsefalsefalse (False in Visual Basic). |
|  | IncludeLevels | True if levels should be brought in from the input file, false otherwise. The default value is falseFalsefalsefalse (False in Visual Basic). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ReplaceDuplicatedGroups | If there are groups with the same names in source and destination documents set this property to trueTruetruetrue (True in Visual Basic) to replace existing groups, otherwise the operation will be canceled. The default value is falseFalsefalsefalse (False in Visual Basic). |

# See Also

GroupLoadOptions Class

Autodesk.Revit.DB Namespace